# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).

connection = ActiveRecord::Base.connection()

# Загружаем статусы контрактов:
connection.execute("INSERT INTO statuses VALUES (5, 'Закрыт', 'Исполнены обязательства  сторон', 5, '2023-08-15 06:13:29.043928', '2023-09-25 02:09:29.581672');
INSERT INTO statuses VALUES (7, 'Заморожен', 'Заморожен', 7, '2023-08-15 06:16:31.456556', '2023-09-25 02:10:00.371821');
INSERT INTO statuses VALUES (6, 'Аннулирован', 'Контракт прекращен', 6, '2023-08-15 06:15:58.972056', '2023-09-25 02:10:15.501118');
INSERT INTO statuses VALUES (1, 'Подписан', 'Документ соглашения подписан  сторонами', 2, '2023-08-15 06:04:45.533111', '2023-09-25 02:10:31.093515');
INSERT INTO statuses VALUES (2, 'В работе', 'выполнение работ (Этап)', 3, '2023-08-15 06:06:31.666567', '2023-09-25 02:11:25.323501');
INSERT INTO statuses VALUES (0, 'В проекте', 'согласование и подписание', 1, '2023-08-15 05:10:21.67173', '2023-09-25 02:11:42.799283');
INSERT INTO statuses VALUES (3, 'Бух.закрытие', 'Выполнены работы, высланы счета и результаты,  нет оплаты (Этап)', 4, '2023-08-15 06:09:12.422463', '2023-09-25 02:11:56.69909');
INSERT INTO statuses VALUES (4, 'Выполнено', 'Выполнена работа  (Этап)', 4, '2023-08-15 06:11:14.982929', '2023-09-25 02:12:09.846144');")

#загружаем регионы
connection.execute("INSERT INTO public.areas VALUES (24, 'Красноярский край', '2023-05-25 07:10:23.364378', '2023-05-25 07:10:23.364378');
INSERT INTO public.areas VALUES (77, 'Москва', '2023-05-25 07:10:23.364378', '2023-05-25 07:10:23.364378');
INSERT INTO public.areas VALUES (28, 'Амурская область', '2023-08-08 08:59:17.580588', '2023-08-08 08:59:17.580588');
INSERT INTO public.areas VALUES (14, 'Республика Саха (Якутия)', '2023-08-08 10:05:01.242281', '2023-08-08 10:05:01.242281');
INSERT INTO public.areas VALUES (54, 'Новосибирская обл', '2023-08-10 05:12:37.976734', '2023-08-10 05:12:37.976734');
INSERT INTO public.areas VALUES (42, 'Кемеровская область ', '2023-08-10 05:14:42.519352', '2023-08-10 05:14:42.519352');
INSERT INTO public.areas VALUES (19, 'Респ Хакасия', '2023-08-10 05:15:28.367304', '2023-08-10 05:15:28.367304');
INSERT INTO public.areas VALUES (22, 'Алтайский край', '2023-08-10 05:16:34.747434', '2023-08-10 05:16:34.747434');
INSERT INTO public.areas VALUES (17, 'Респ Тыва', '2023-08-10 05:31:31.264325', '2023-08-10 05:31:31.264325');
INSERT INTO public.areas VALUES (27, 'Хабаровский край', '2023-08-10 05:32:41.969467', '2023-08-10 05:32:41.969467');
INSERT INTO public.areas VALUES (38, 'Иркутская обл', '2023-08-10 06:19:08.310592', '2023-08-10 06:19:08.310592');
INSERT INTO public.areas VALUES (65, 'Сахалинская обл', '2024-02-24 10:45:18.321158', '2024-02-24 10:45:18.321158');
INSERT INTO public.areas VALUES (663300, 'НОРИЛЬСК', '2023-05-25 07:10:23.364378', '2024-02-28 14:29:02.516968');
INSERT INTO public.areas VALUES (660000, 'КРАСНОЯРСК', '2023-05-25 07:10:23.364378', '2024-02-28 14:29:39.819633');
INSERT INTO public.areas VALUES (2, 'Республика Башкортостан', '2024-02-28 14:33:16.785083', '2024-02-28 14:33:16.785083');
INSERT INTO public.areas VALUES (3, 'Республика Бурятия', '2024-02-28 14:33:54.910888', '2024-02-28 14:33:54.910888');
INSERT INTO public.areas VALUES (4, 'Республика Алтай', '2024-02-28 14:34:31.352342', '2024-02-28 14:34:31.352342');
INSERT INTO public.areas VALUES (5, 'Республика Дагестан', '2024-02-28 14:35:12.015324', '2024-02-28 14:35:12.015324');
INSERT INTO public.areas VALUES (6, 'Республика Ингушетия', '2024-02-28 14:35:54.908167', '2024-02-28 14:35:54.908167');
INSERT INTO public.areas VALUES (7, 'Кабардино-Балкарская Республика', '2024-02-28 14:36:24.966683', '2024-02-28 14:36:24.966683');
INSERT INTO public.areas VALUES (8, 'Республика Калмыкия', '2024-02-28 14:36:50.467475', '2024-02-28 14:36:50.467475');
INSERT INTO public.areas VALUES (9, 'Карачаево-Черкесская Республика', '2024-02-28 14:37:26.082415', '2024-02-28 14:37:26.082415');
INSERT INTO public.areas VALUES (10, 'Республика Карелия', '2024-02-28 14:37:54.380082', '2024-02-28 14:37:54.380082');
INSERT INTO public.areas VALUES (11, 'Республика Коми', '2024-02-28 14:38:35.193275', '2024-02-28 14:38:35.193275');
INSERT INTO public.areas VALUES (12, 'Республика Марий Эл', '2024-02-28 14:39:05.713602', '2024-02-28 14:39:05.713602');
INSERT INTO public.areas VALUES (13, 'Республика Мордовия', '2024-02-28 14:39:30.612432', '2024-02-28 14:39:30.612432');
INSERT INTO public.areas VALUES (15, 'Республика Северная Осетия - Алания', '2024-02-28 14:51:08.302171', '2024-02-28 14:51:08.302171');
INSERT INTO public.areas VALUES (16, 'Республика Татарстан (Татарстан)', '2024-02-28 14:51:52.568112', '2024-02-28 14:51:52.568112');
INSERT INTO public.areas VALUES (18, 'Удмуртская Республика', '2024-02-28 14:52:22.043231', '2024-02-28 14:52:22.043231');
INSERT INTO public.areas VALUES (20, 'Чеченская Республика', '2024-02-28 14:52:57.876734', '2024-02-28 14:52:57.876734');
INSERT INTO public.areas VALUES (21, 'Чувашская Республика - Чувашия', '2024-02-28 14:53:25.281624', '2024-02-28 14:53:25.281624');
INSERT INTO public.areas VALUES (23, 'Краснодарский край', '2024-02-28 14:53:49.633206', '2024-02-28 14:53:49.633206');
INSERT INTO public.areas VALUES (25, 'Приморский край', '2024-02-28 14:54:23.537092', '2024-02-28 14:54:23.537092');
INSERT INTO public.areas VALUES (26, 'Ставропольский край', '2024-02-28 14:54:46.523395', '2024-02-28 14:54:46.523395');
INSERT INTO public.areas VALUES (29, 'Архангельская область', '2024-02-28 14:55:10.263781', '2024-02-28 14:55:10.263781');
INSERT INTO public.areas VALUES (30, 'Астраханская область', '2024-02-28 14:55:48.835676', '2024-02-28 14:55:48.835676');
INSERT INTO public.areas VALUES (31, 'Белгородская область', '2024-02-28 14:56:13.113313', '2024-02-28 14:56:13.113313');
INSERT INTO public.areas VALUES (32, 'Брянская область', '2024-02-28 14:56:40.950895', '2024-02-28 14:56:40.950895');
INSERT INTO public.areas VALUES (33, 'Владимирская область', '2024-02-28 14:57:08.942806', '2024-02-28 14:57:08.942806');
INSERT INTO public.areas VALUES (34, 'Волгоградская область', '2024-02-28 14:57:37.159767', '2024-02-28 14:57:37.159767');
INSERT INTO public.areas VALUES (35, 'Вологодская область', '2024-02-28 14:58:15.665272', '2024-02-28 14:58:15.665272');
INSERT INTO public.areas VALUES (36, 'Воронежская область', '2024-02-28 14:58:42.203187', '2024-02-28 14:58:42.203187');
INSERT INTO public.areas VALUES (37, 'Ивановская область', '2024-02-28 14:59:05.485291', '2024-02-28 14:59:05.485291');
INSERT INTO public.areas VALUES (39, 'Калининградская область', '2024-02-28 14:59:34.555711', '2024-02-28 14:59:34.555711');
INSERT INTO public.areas VALUES (40, 'Калужская область', '2024-02-28 15:00:04.214062', '2024-02-28 15:00:04.214062');
INSERT INTO public.areas VALUES (41, 'Камчатский край', '2024-02-28 15:00:33.353696', '2024-02-28 15:00:33.353696');
INSERT INTO public.areas VALUES (43, 'Кировская область', '2024-02-28 15:01:00.378284', '2024-02-28 15:01:00.378284');
INSERT INTO public.areas VALUES (44, 'Костромская область', '2024-02-28 17:33:37.595625', '2024-02-28 17:33:37.595625');
INSERT INTO public.areas VALUES (45, 'Курганская область', '2024-02-28 17:34:04.435743', '2024-02-28 17:34:04.435743');
INSERT INTO public.areas VALUES (46, 'Курская область', '2024-02-28 17:34:31.9656', '2024-02-28 17:34:31.9656');
INSERT INTO public.areas VALUES (47, 'Ленинградская область', '2024-02-28 17:35:01.041194', '2024-02-28 17:35:01.041194');
INSERT INTO public.areas VALUES (48, 'Липецкая область', '2024-02-28 17:36:39.068943', '2024-02-28 17:36:39.068943');
INSERT INTO public.areas VALUES (49, 'Магаданская область', '2024-02-28 17:37:03.408132', '2024-02-28 17:37:03.408132');
INSERT INTO public.areas VALUES (50, 'Московская область', '2024-02-28 17:37:29.166785', '2024-02-28 17:37:29.166785');
INSERT INTO public.areas VALUES (51, 'Мурманская область', '2024-02-28 18:03:29.985015', '2024-02-28 18:03:29.985015');
INSERT INTO public.areas VALUES (52, 'Нижегородская область', '2024-02-28 18:03:58.123846', '2024-02-28 18:03:58.123846');
INSERT INTO public.areas VALUES (53, 'Новгородская область', '2024-02-28 18:04:35.957473', '2024-02-28 18:04:35.957473');
INSERT INTO public.areas VALUES (55, 'Омская область', '2024-02-28 18:05:18.152634', '2024-02-28 18:05:18.152634');
INSERT INTO public.areas VALUES (56, 'Оренбургская область', '2024-02-28 18:06:24.561165', '2024-02-28 18:06:24.561165');
INSERT INTO public.areas VALUES (57, 'Орловская область', '2024-02-28 18:06:50.914187', '2024-02-28 18:06:50.914187');
INSERT INTO public.areas VALUES (58, 'Пензенская область', '2024-02-28 18:07:47.361755', '2024-02-28 18:07:47.361755');
INSERT INTO public.areas VALUES (59, 'Пермский край', '2024-02-28 18:08:26.526669', '2024-02-28 18:08:26.526669');
INSERT INTO public.areas VALUES (60, 'Псковская область', '2024-02-28 18:09:08.863623', '2024-02-28 18:09:08.863623');
INSERT INTO public.areas VALUES (61, 'Ростовская область', '2024-02-28 18:09:45.556119', '2024-02-28 18:09:45.556119');
INSERT INTO public.areas VALUES (62, 'Рязанская область', '2024-02-28 18:10:31.045297', '2024-02-28 18:10:31.045297');
INSERT INTO public.areas VALUES (63, 'Самарская область', '2024-02-28 18:11:02.474132', '2024-02-28 18:11:02.474132');
INSERT INTO public.areas VALUES (64, 'Саратовская область', '2024-02-28 18:11:37.354935', '2024-02-28 18:11:37.354935');
INSERT INTO public.areas VALUES (66, 'Свердловская область', '2024-02-28 18:12:12.633304', '2024-02-28 18:12:12.633304');
INSERT INTO public.areas VALUES (67, 'Смоленская область', '2024-02-28 18:12:48.649357', '2024-02-28 18:12:48.649357');
INSERT INTO public.areas VALUES (68, 'Тамбовская область', '2024-02-28 18:13:10.27575', '2024-02-28 18:13:10.27575');
INSERT INTO public.areas VALUES (69, 'Тверская область', '2024-02-28 18:13:39.809622', '2024-02-28 18:13:39.809622');
INSERT INTO public.areas VALUES (70, 'Томская область', '2024-02-28 18:14:49.345106', '2024-02-28 18:14:49.345106');
INSERT INTO public.areas VALUES (71, 'Тульская область', '2024-02-28 18:15:25.243792', '2024-02-28 18:15:25.243792');
INSERT INTO public.areas VALUES (72, 'Тюменская область', '2024-02-28 18:16:10.882069', '2024-02-28 18:16:10.882069');
INSERT INTO public.areas VALUES (73, 'Ульяновская область', '2024-02-28 18:17:01.588449', '2024-02-28 18:17:01.588449');
INSERT INTO public.areas VALUES (74, 'Челябинская область', '2024-02-28 18:17:34.32782', '2024-02-28 18:17:34.32782');
INSERT INTO public.areas VALUES (75, 'Забайкальский край', '2024-02-28 18:18:11.953728', '2024-02-28 18:18:11.953728');
INSERT INTO public.areas VALUES (76, 'Ярославская область', '2024-02-28 18:18:42.259778', '2024-02-28 18:18:42.259778');
INSERT INTO public.areas VALUES (78, 'г. Санкт-Петербург', '2024-02-28 18:19:14.49488', '2024-02-28 18:19:14.49488');
INSERT INTO public.areas VALUES (79, 'Еврейская автономная область', '2024-02-28 18:20:05.669697', '2024-02-28 18:20:05.669697');
INSERT INTO public.areas VALUES (83, 'Ненецкий автономный округ', '2024-02-28 18:21:32.095128', '2024-02-28 18:21:32.095128');
INSERT INTO public.areas VALUES (86, 'Ханты-Мансийский автономный округ - Югра', '2024-02-28 18:21:58.193471', '2024-02-28 18:21:58.193471');
INSERT INTO public.areas VALUES (87, 'Чукотский автономный округ', '2024-02-28 18:22:27.468404', '2024-02-28 18:22:27.468404');
INSERT INTO public.areas VALUES (91, 'Республика Крым', '2024-02-28 18:23:43.321983', '2024-02-28 18:23:43.321983');
INSERT INTO public.areas VALUES (92, 'г. Севастополь', '2024-02-28 18:24:07.126927', '2024-02-28 18:24:07.126927');
INSERT INTO public.areas VALUES (99, 'Иные территории, включая город и космодром Байконур', '2024-02-28 18:24:41.001605', '2024-02-28 18:24:41.001605');
INSERT INTO public.areas VALUES (1, 'Республика Адыгея (Адыгея)', '2024-02-28 14:32:39.041881', '2024-02-28 14:32:39.041881');
INSERT INTO public.areas VALUES (89, 'ЯмалоНенецкий автономный округ', '2024-02-28 18:23:14.877949', '2024-02-28 18:23:14.877949');")

#загружаем отделы
connection.execute("INSERT INTO public.departments VALUES (1, 'ОЗИ', '0,1,2,3,4,6', '0,4,6,7,8,9,13', '2023-05-25 07:10:23.343337', '2023-05-25 07:10:23.343337');
INSERT INTO public.departments VALUES (2, 'Коммерческий', '0,1,2,3,4,5,6,7,8', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16', '2023-05-25 07:10:23.343337', '2023-05-25 07:10:23.343337');
INSERT INTO public.departments VALUES (3, 'Бухгалтерия', '0,1,2,3,4,5,6,7,8', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16', '2023-05-25 07:10:23.343337', '2023-05-25 07:10:23.343337');
INSERT INTO public.departments VALUES (4, 'Руководство', '0,1,2,3,4,5,6,7,8', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16', '2023-05-25 07:10:23.343337', '2023-05-25 07:10:23.343337');
INSERT INTO public.departments VALUES (5, 'ИЛЦ', '0,1,2,3,4,5,6,7,8', '16,17,15,18', '2023-05-25 07:10:23.343337', '2023-05-25 07:10:23.343337');
INSERT INTO public.departments VALUES (6, 'ОПС', '0,1,2,3,4,6', '16,17,15,18', '2023-05-25 07:10:23.343337', '2023-05-25 07:10:23.343337');")

#загружаем типы контрагентов
connection.execute("INSERT INTO public.ownerships VALUES (2, 'ЧУЗ', 'Частное учреждение здравоохранения', '2023-05-25 07:10:23.312129', '2023-05-25 07:10:23.312129', NULL);
INSERT INTO public.ownerships VALUES (1, 'ООО', 'Общество с ограниченой ответственностью', '2023-05-25 07:10:23.312129', '2023-05-25 07:10:23.312129', 12300);
INSERT INTO public.ownerships VALUES (5, 'АО', 'Непубличные акционерные общества', '2023-05-25 07:10:23.312129', '2023-05-25 07:10:23.312129', 12267);
INSERT INTO public.ownerships VALUES (7, 'ФГУП', 'Федеральные государственные унитарные предприятия', '2024-02-23 17:42:10.793303', '2024-02-23 18:18:32.703822', 65241);
INSERT INTO public.ownerships VALUES (8, 'ФГБУ', 'Федеральные государственные бюджетные учреждения', '2024-02-24 08:01:40.322672', '2024-02-24 08:01:40.322672', 75103);
INSERT INTO public.ownerships VALUES (9, 'ФГКУ', 'Федеральные государственные казенные учреждения', '2024-02-24 08:21:22.206023', '2024-02-24 08:21:55.950618', 75104);
INSERT INTO public.ownerships VALUES (10, 'МКУ', 'Муниципальные казенные учреждения', '2024-02-24 08:40:04.515869', '2024-02-24 08:40:04.515869', 75404);
INSERT INTO public.ownerships VALUES (11, 'ГУП СФ', 'Государственные унитарные предприятия субъектов Российской Федерации', '2024-02-24 08:58:56.674152', '2024-02-24 08:58:56.674152', 65242);
INSERT INTO public.ownerships VALUES (6, 'ЗАО', 'ЗАКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО', '2023-08-11 07:24:57.911203', '2024-02-24 09:04:43.82878', 12267);
INSERT INTO public.ownerships VALUES (12, 'МУП', 'Муниципальные унитарные предприятия', '2024-02-24 09:26:52.062552', '2024-02-24 09:26:52.062552', 65243);
INSERT INTO public.ownerships VALUES (13, 'МКП', 'Муниципальные казенные предприятия', '2024-02-24 09:31:30.194158', '2024-02-24 09:31:30.194158', 65143);
INSERT INTO public.ownerships VALUES (14, 'ФКП', 'Федеральные казенные предприятия', '2024-02-24 09:34:28.316535', '2024-02-24 09:34:28.316535', 65141);
INSERT INTO public.ownerships VALUES (15, 'КП СФ', 'Казенные предприятия субъектов Российской Федерации', '2024-02-24 09:37:23.052106', '2024-02-24 09:37:23.052106', 65142);
INSERT INTO public.ownerships VALUES (16, 'ФГАУ', 'Федеральные государственные автономные учреждения', '2024-02-24 09:40:21.276078', '2024-02-24 09:40:21.276078', 75101);
INSERT INTO public.ownerships VALUES (17, 'ГАУ СФ', 'Государственные автономные учреждения субъектов Российской Федерации', '2024-02-24 09:45:39.785935', '2024-02-24 09:45:39.785935', 75201);
INSERT INTO public.ownerships VALUES (4, 'ГБУ СФ', 'Государственные бюджетные учреждения субъектов Российской Федерации', '2023-08-11 07:24:09.284061', '2024-02-24 09:49:06.177059', 75203);
INSERT INTO public.ownerships VALUES (18, 'ГКУ СФ', 'Государственные казенные учреждения субъектов Российской Федерации', '2024-02-24 09:50:54.099082', '2024-02-24 09:50:54.099082', 75204);
INSERT INTO public.ownerships VALUES (19, 'МАУ', 'Муниципальные автономные учреждения', '2024-02-24 09:53:52.598436', '2024-02-24 09:53:52.598436', 75401);
INSERT INTO public.ownerships VALUES (20, 'МБУ', 'Муниципальные бюджетные учреждения', '2024-02-24 09:55:32.150023', '2024-02-24 09:55:32.150023', 75403);
INSERT INTO public.ownerships VALUES (21, 'ОУ', 'Общественные учреждения', '2024-02-24 09:59:33.64808', '2024-02-24 09:59:33.64808', 75505);
INSERT INTO public.ownerships VALUES (22, 'ГВФ РФ', 'Государственные внебюджетные фонды Российской Федерации', '2024-02-24 10:32:15.333603', '2024-02-24 10:32:15.333603', 75105);
INSERT INTO public.ownerships VALUES (23, 'ПАО', 'Публичные акционерные общества', '2024-02-24 10:33:27.464567', '2024-02-24 10:33:27.464567', 12247);
INSERT INTO public.ownerships VALUES (3, 'ОАО', 'Открытые акционерные общества', '2023-05-25 07:10:23.312129', '2024-02-24 10:33:49.225683', 12247);")

#загружаем Типы задач контрактов
connection.execute("INSERT INTO public.task_kinds VALUES (4, 'Счет ИЛЦ', '04', 'выставить счет на ИЛЦ', NULL, NULL, '2023-09-05 04:36:25.760253', '2023-09-25 02:06:14.336765');
INSERT INTO public.task_kinds VALUES (5, 'Счет ОПС', '03', 'работа по ОПС', NULL, NULL, '2023-09-05 04:36:57.386696', '2023-09-25 02:06:49.073422');
INSERT INTO public.task_kinds VALUES (6, 'Контрольная проверка', '05', 'Проверка на соответствия нормам защиты', NULL, NULL, '2023-09-05 04:37:32.611522', '2023-09-25 02:07:17.00965');
INSERT INTO public.task_kinds VALUES (7, 'Доп. аттестация', '06', 'Дополнительные аттестационные испытания оборудования и помещений', NULL, NULL, '2023-09-05 04:38:48.745604', '2023-09-25 02:07:44.883043');
INSERT INTO public.task_kinds VALUES (2, 'Счет на журналы', '01', 'счет на журналы', NULL, NULL, '2023-08-14 04:36:06.92977', '2023-09-25 02:08:01.380805');
INSERT INTO public.task_kinds VALUES (9, 'Аттестация или специальная проверка', '15', 'атестация на соответствие требованиям ФСТЭК', NULL, NULL, '2023-09-05 04:43:46.20896', '2023-09-25 02:08:28.760388');
INSERT INTO public.task_kinds VALUES (8, 'ОПС', '11', 'ОПС, Включая обслуживание', NULL, NULL, '2023-09-05 04:42:50.539136', '2023-09-25 02:08:39.39425');
INSERT INTO public.task_kinds VALUES (10, 'Поставка СЗИ', NULL, 'требуется поставка СЗИ', NULL, NULL, '2023-09-07 00:29:49.469984', '2023-09-25 02:09:04.669197');
INSERT INTO public.task_kinds VALUES (3, 'Счет ОЗИ', '00', 'счет на ОЗИ', NULL, NULL, '2023-09-05 04:33:36.934824', '2023-09-25 02:22:06.229919');
INSERT INTO public.task_kinds VALUES (11, 'Поставка ПО', NULL, NULL, NULL, NULL, '2023-09-28 07:25:36.605305', '2023-09-28 07:25:36.605305');
INSERT INTO public.task_kinds VALUES (12, 'Поставка ЭВМ', NULL, NULL, NULL, NULL, '2023-09-28 07:26:26.235221', '2023-09-28 07:26:26.235221');
INSERT INTO public.task_kinds VALUES (13, 'Разработка ПДИТР', NULL, NULL, NULL, NULL, '2023-09-29 09:02:33.718192', '2023-09-29 09:02:33.718192');
INSERT INTO public.task_kinds VALUES (1, 'Счет на обучение', '02', 'счет на обучение', 14000, 15, '2023-08-14 03:14:53.382348', '2023-12-05 13:18:36.93155');
INSERT INTO public.task_kinds VALUES (14, 'Поставка от ЦБС', '20', NULL, NULL, NULL, '2024-03-01 09:50:31.719363', '2024-03-01 09:50:31.719363');
INSERT INTO public.task_kinds VALUES (15, 'Прочие договора', '25', NULL, NULL, NULL, '2024-03-01 09:51:25.264537', '2024-03-01 09:51:25.264537');
INSERT INTO public.task_kinds VALUES (16, 'ЭЦП', '30', 'Выдача сертификатов ЭЦП', NULL, NULL, '2024-03-01 09:52:44.105612', '2024-03-01 09:52:44.105612');
INSERT INTO public.task_kinds VALUES (17, 'ИСПДн', '35', NULL, NULL, NULL, '2024-03-01 09:53:35.690076', '2024-03-01 09:53:35.690076');
INSERT INTO public.task_kinds VALUES (18, 'Поставка от ЩИТа', '40', NULL, NULL, NULL, '2024-03-01 09:55:22.133595', '2024-03-01 09:55:22.133595');
INSERT INTO public.task_kinds VALUES (19, 'Обслуживание РСС', '45', NULL, NULL, NULL, '2024-03-01 09:56:09.110955', '2024-03-01 09:56:09.110955');
INSERT INTO public.task_kinds VALUES (20, 'Обучение', '50', NULL, NULL, NULL, '2024-03-01 09:57:16.127505', '2024-03-01 09:57:16.127505');
INSERT INTO public.task_kinds VALUES (21, 'Обслуживание ОЗИ', '55', NULL, NULL, NULL, '2024-03-01 09:57:56.698885', '2024-03-01 09:57:56.698885');
INSERT INTO public.task_kinds VALUES (22, 'Поставка журналов', '60', NULL, NULL, NULL, '2024-03-01 09:58:50.496945', '2024-03-01 09:58:50.496945');
INSERT INTO public.task_kinds VALUES (23, 'СОУТ', '70', NULL, NULL, NULL, '2024-03-01 09:59:44.912806', '2024-03-01 09:59:44.912806');
INSERT INTO public.task_kinds VALUES (24, 'Оценка профрисков', '75', NULL, NULL, NULL, '2024-03-01 10:00:34.455129', '2024-03-01 10:00:34.455129');
INSERT INTO public.task_kinds VALUES (25, 'ПК', '80', 'Производственный контроль', NULL, NULL, '2024-03-01 10:01:13.126635', '2024-03-01 10:01:13.126635');
INSERT INTO public.task_kinds VALUES (26, 'Тест СЗИ', '10', 'Тестирование средств защиты информации', NULL, NULL, '2024-03-01 10:01:13.126635', '2024-03-01 10:01:13.126635');")

#загружаем статусы заказов СЗИ
connection.execute("INSERT INTO public.order_statuses VALUES (1, 'Заказано', NULL, 1, '2024-03-01 09:44:36.887354', '2024-03-01 09:44:36.887354');
INSERT INTO public.order_statuses VALUES (2, 'Пришло частично', NULL, 2, '2024-03-01 09:45:06.042193', '2024-03-01 09:45:06.042193');
INSERT INTO public.order_statuses VALUES (3, 'Пришло', NULL, 3, '2024-03-01 09:45:25.022755', '2024-03-01 09:45:25.022755');
INSERT INTO public.order_statuses VALUES (4, 'Отменено', NULL, 4, '2024-03-01 09:45:46.238859', '2024-03-01 09:45:46.238859');")
